# DuplicateInstances Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OverlapFailures..::..DuplicateInstances Property
BuiltInFailures..::..OverlapFailures Class See Also
---
There are identical instances in the same place. This will result in double counting in schedules.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DuplicateInstances { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuplicateInstances As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DuplicateInstances {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OverlapFailures Class
Autodesk.Revit.DB Namespace